thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
/****************************************************************************
 * arch/arm/src/stm32/stm32_stepper.c
 *
 *   Copyright (C) 2015 Haltian Ltd. All rights reserved.
 *   Authors: Harri Luhtala <harri.luhtala@harri.luhtala@haltian.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/motor/stepper.h>
#include <arch/board/board.h>

#include "up_internal.h"
#include "up_arch.h"

#include "chip.h"
#include "stm32_stepper.h"
#include "stm32.h"


/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Debug ********************************************************************/
/* Non-standard debug that may be enabled just for testing stepper control */

#ifndef CONFIG_DEBUG
#  undef CONFIG_STEPPER_DEBUG
#endif

#ifdef CONFIG_STEPPER_DEBUG
#  define stepperdbg              dbg
#  define stepperlldbg            lldbg
#  ifdef CONFIG_DEBUG_VERBOSE
#    define steppervdbg           vdbg
#    define stepperllvdbg         llvdbg
#    define stepper_dumpgpio(p,m) stm32_dumpgpio(p,m)
#  else
#    define steppervdbg(x...)
#    define stepperllvdbg(x...)
#    define stepper_dumpgpio(p,m)
#  endif
#else
#  define stepperdbg(x...)
#  define stepperlldbg(x...)
#  define steppervdbg(x...)
#  define stepperllvdbg(x...)
#  define stepper_dumpgpio(p,m)
#endif

#define MAX_STEP_INDEX  3

#define STEP_INDEX_CW \
  (putreg32((getreg32(priv->pattern_bkreg) + 1) % \
  (MAX_STEP_INDEX + 1), priv->pattern_bkreg))

#define STEP_INDEX_CCW \
  { \
    uint32_t __regval = getreg32(priv->pattern_bkreg); \
    putreg32(__regval == 0? MAX_STEP_INDEX: __regval - 1, priv->pattern_bkreg); \
  }

enum drive_direction_e
{
  DIR_CW = 0,
  DIR_CCW
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure represents the state of one motor control channel */

struct stm32_stepper_s
{
  FAR const struct stepper_ops_s *ops;  /* Motor control operations */
  uint8_t timid;                        /* Timer ID */
  uint8_t irq;                          /* Timer update IRQ */
  enum drive_direction_e direction;     /* Drive direction */
  uint8_t gpio_port;                    /* GPIO port number */
  uint32_t pattern_bkreg;               /* Pattern index backup register */
  uint32_t position_bkreg;              /* Position index backup register */
  uint32_t step[MAX_STEP_INDEX + 1];    /* Step pattern GPIO BSRR config */
  uint32_t step_break;                  /* Break step pattern */
  uint32_t step_standby;                /* Standby step pattern */
  uint32_t frequency;                   /* Stepping frequency */
  uint32_t tim_base;                    /* The base address of the timer */
  uint32_t pclk;                        /* The frequency of the peripheral clock */
  volatile int32_t target_pos;          /* Target position index */
  FAR void *handle;                     /* Handle used for upper-half callback */
};

/****************************************************************************
 * Static Function Prototypes
 ****************************************************************************/
/* Register access */

static uint16_t stepper_getreg(struct stm32_stepper_s *priv, int offset);
static void stepper_putreg(struct stm32_stepper_s *priv, int offset, uint16_t value);

#if defined(CONFIG_STEPPER_DEBUG) && defined(CONFIG_DEBUG_VERBOSE)
static void stepper_dumpregs(struct stm32_stepper_s *priv, FAR const char *msg);
#else
#  define stepper_dumpregs(priv,msg)
#endif

/* Timer management */

static int stepper_timer(FAR struct stm32_stepper_s *priv,
                         FAR const struct stepper_info_s *info);
static int stepper_interrupt(struct stm32_stepper_s *priv);
static int stepper_tim2interrupt(int irq, void *context);
static int stepper_tim3interrupt(int irq, void *context);
static int stepper_tim4interrupt(int irq, void *context);
static int stepper_tim5interrupt(int irq, void *context);

/* Stepper driver methods */

static int stepper_setup(FAR struct stepper_lowerhalf_s *dev);

static int stepper_shutdown(FAR struct stepper_lowerhalf_s *dev);

static int stepper_set_pos(FAR struct stepper_lowerhalf_s *dev,
                           FAR const struct stepper_info_s *info,
                           FAR void *handle);

static int stepper_get_status(FAR struct stepper_lowerhalf_s *dev,
                              FAR struct stepper_status_s *status);

