thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
static int stepper_reset_index(FAR struct stepper_lowerhalf_s *dev);

static int stepper_set_pattern_index(FAR struct stepper_lowerhalf_s *dev,
                                     unsigned int index);

static int stepper_stop(FAR struct stepper_lowerhalf_s *dev);

static int stepper_ioctl(FAR struct stepper_lowerhalf_s *dev,
                         int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This is the list of lower half stepper motor control methods used by
   the upper half driver */

static const struct stepper_ops_s g_stepperops =
{
  .setup             = stepper_setup,
  .shutdown          = stepper_shutdown,
  .set_pos           = stepper_set_pos,
  .get_status        = stepper_get_status,
  .reset_index       = stepper_reset_index,
  .set_pattern_index = stepper_set_pattern_index,
  .stop              = stepper_stop,
  .ioctl             = stepper_ioctl,
};

#ifdef CONFIG_STM32_TIM2_STEPPER
static struct stm32_stepper_s g_stepper2dev =
{
  .ops        = &g_stepperops,

  .step       = {
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),
                },

  .step_break = GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .step_standby =
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM2_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .gpio_port  = (GPIO_PORT_MASK & TIM2_GPIO_P1_P) >> GPIO_PORT_SHIFT,

  .timid      = 2,
  .irq        = STM32_IRQ_TIM2,
  .tim_base   = STM32_TIM2_BASE,
  .pclk       = STM32_APB1_TIM2_CLKIN,

  .pattern_bkreg = TIM2_PATTERN_BKREG,
  .position_bkreg = TIM2_POSITION_BKREG,
};
#endif

#ifdef CONFIG_STM32_TIM3_STEPPER
static struct stm32_stepper_s g_stepper3dev =
{
  .ops        = &g_stepperops,

  .step       = {
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),
                },

  .step_break = GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .step_standby =
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM3_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .gpio_port =  (GPIO_PORT_MASK & TIM3_GPIO_P1_P) >> GPIO_PORT_SHIFT,

  .timid      = 3,
  .irq        = STM32_IRQ_TIM3,
  .tim_base   = STM32_TIM3_BASE,
  .pclk       = STM32_APB1_TIM3_CLKIN,

  .pattern_bkreg = TIM3_PATTERN_BKREG,
  .position_bkreg = TIM3_POSITION_BKREG,
};
#endif

