thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
#ifdef CONFIG_STM32_TIM4_STEPPER
static struct stm32_stepper_s g_stepper4dev =
{
  .ops        =  &g_stepperops,

  .step       = {
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),
                },

  .step_break = GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .step_standby =
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM4_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .gpio_port =  (GPIO_PORT_MASK & TIM4_GPIO_P1_P) >> GPIO_PORT_SHIFT,

  .timid     =  4,
  .irq       =  STM32_IRQ_TIM4,
  .tim_base  =  STM32_TIM4_BASE,
  .pclk      =  STM32_APB1_TIM4_CLKIN,

  .pattern_bkreg = TIM4_PATTERN_BKREG,
  .position_bkreg = TIM4_POSITION_BKREG,
};
#endif

#ifdef CONFIG_STM32_TIM5_STEPPER
static struct stm32_stepper_s g_stepper5dev =
{
  .ops        = &g_stepperops,

  .step       = {
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK &TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),
                },

  .step_break = GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_SET( (GPIO_PIN_MASK & TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .step_standby =
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P1_N) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P2_P) >> GPIO_PIN_SHIFT ) |
                GPIO_BSRR_RESET( (GPIO_PIN_MASK & TIM5_GPIO_P2_N) >> GPIO_PIN_SHIFT ),

  .gpio_port  = (GPIO_PORT_MASK & TIM5_GPIO_P1_P) >> GPIO_PORT_SHIFT,

  .timid      = 5,
  .irq        = STM32_IRQ_TIM5,
  .tim_base   = STM32_TIM5_BASE,
  .pclk       = STM32_APB1_TIM5_CLKIN,

  .pattern_bkreg = TIM5_PATTERN_BKREG,
  .position_bkreg = TIM5_POSITION_BKREG,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stepper_getreg
 *
 * Description:
 *   Read the value of an 16-bit timer register.
 *
 * Input Parameters:
 *   priv - reference to the stepper status
 *   offset - offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint16_t stepper_getreg(struct stm32_stepper_s *priv, int offset)
{
  return getreg16(priv->tim_base + offset);
}

/****************************************************************************
 * Name: stepper_getreg32
 *
 * Description:
 *   Read the value of an 32-bit timer register.
 *
 * Input Parameters:
 *   priv - reference to the stepper status
 *   offset - offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t stepper_getreg32(struct stm32_stepper_s *priv, int offset)
{
  return getreg32(priv->tim_base + offset);
}

/****************************************************************************
 * Name: stepper_putreg
 *
 * Description:
 *   Write the value for an timer register.
 *
 * Input Parameters:
 *   priv - reference to the stepper status
 *   offset - offset to the register to read
 *   value - value
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stepper_putreg(struct stm32_stepper_s *priv, int offset, uint16_t value)
{
  putreg16(value, priv->tim_base + offset);
}

/****************************************************************************
 * Name: stepper_putreg32
 *
 * Description:
 *   Write the value for an 32-bit timer register.
 *
 * Input Parameters:
 *   priv - reference to the stepper status
 *   offset - offset to the register to read
 *   value - value
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stepper_putreg32(struct stm32_stepper_s *priv, int offset, uint32_t value)
{
  putreg32(value, priv->tim_base + offset);
}

/****************************************************************************
 * Name: stepper_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input parameters:
 *   priv - reference to the stepper status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if defined(CONFIG_STEPPER_DEBUG) && defined(CONFIG_DEBUG_VERBOSE)
static void stepper_dumpregs(struct stm32_stepper_s *priv, FAR const char *msg)
{
  steppervdbg("%s: (id:%d, base:0x%04X)\n", msg, priv->timid, priv->tim_base);
  steppervdbg("CR1:%04x CR2:%04x SMCR:%04x DIER:%04x\n",
          stepper_getreg(priv, STM32_GTIM_CR1_OFFSET),
          stepper_getreg(priv, STM32_GTIM_CR2_OFFSET),
          stepper_getreg(priv, STM32_GTIM_SMCR_OFFSET),
          stepper_getreg(priv, STM32_GTIM_DIER_OFFSET));
  steppervdbg("SR:%04x EGR:%04x CCMR1:%04x CCMR2:%04x\n",
          stepper_getreg(priv, STM32_GTIM_SR_OFFSET),
          stepper_getreg(priv, STM32_GTIM_EGR_OFFSET),
          stepper_getreg(priv, STM32_GTIM_CCMR1_OFFSET),
          stepper_getreg(priv, STM32_GTIM_CCMR2_OFFSET));
  steppervdbg("CCER:%04x CNT:%08x PSC:%04x ARR:%04x\n",
          stepper_getreg(priv, STM32_GTIM_CCER_OFFSET),
          stepper_getreg32(priv, STM32_GTIM_CNT_OFFSET),
          stepper_getreg(priv, STM32_GTIM_PSC_OFFSET),
          stepper_getreg(priv, STM32_GTIM_ARR_OFFSET));
  steppervdbg("CCR1:%08x CCR2:%08x CCR3:%08x CCR4:%08x\n",
          stepper_getreg32(priv, STM32_GTIM_CCR1_OFFSET),
          stepper_getreg32(priv, STM32_GTIM_CCR2_OFFSET),
          stepper_getreg32(priv, STM32_GTIM_CCR3_OFFSET),
          stepper_getreg32(priv, STM32_GTIM_CCR4_OFFSET));
  steppervdbg("DCR:%04x DMAR:%04x\n",
          stepper_getreg(priv, STM32_GTIM_DCR_OFFSET),
          stepper_getreg(priv, STM32_GTIM_DMAR_OFFSET));
}
#endif

/****************************************************************************
 * Name: stepper_setup_frequency
 *
 * Description:
 *   Setup timer registers for desired step pattern frequency
 *
 * Input parameters:
 *   priv      - reference to the stepper status
 *   frequency - step pattern frequency
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stepper_setup_frequency(FAR struct stm32_stepper_s *priv,
                                    uint32_t frequency)
{
  uint32_t prescaler;
  uint32_t timclk;
  uint32_t reload;

  DEBUGASSERT(frequency > 0);

  /* Calculate optimal values for the timer prescaler and for the timer
   * reload register. */

  prescaler = (priv->pclk / frequency + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = priv->pclk / prescaler;

