thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
  /* Reload value defines step pattern frequency. */

  reload = timclk / frequency;
  if (reload < 1)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }

  priv->frequency = frequency;

  steppervdbg("TIM%d PCLK:%d, freq:%d, TIMCLK:%d, prescaler:%d, reload:%d\n",
    priv->timid, priv->pclk, frequency, timclk, prescaler, reload);

  /* Set the reload and prescaler values */

  stepper_putreg32(priv, STM32_GTIM_ARR_OFFSET, reload);
  stepper_putreg(priv, STM32_GTIM_PSC_OFFSET, (uint16_t)(prescaler - 1));

  /* Generate an update event to reload the prescaler (all timers) */

  stepper_putreg(priv, STM32_GTIM_EGR_OFFSET, GTIM_EGR_UG);
}

/****************************************************************************
 * Name: stepper_timer
 *
 * Description:
 *   Initialize the timer resources and start step pattern output
 *
 * Input parameters:
 *   priv      - lower half stepper state
 *   frequency - step pattern frequency
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_timer(FAR struct stm32_stepper_s *priv,
                         FAR const struct stepper_info_s *info)
{
  /* Register contents */

  uint16_t cr1;
  uint16_t ccer;

  DEBUGASSERT(priv != NULL);

  steppervdbg("TIM%d, freq:%d\n", priv->timid, info->frequency);

  DEBUGASSERT(info->frequency > 0);

  /* Disable all interrupts and clear all pending status */

  stepper_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  stepper_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  cr1 = stepper_getreg(priv, STM32_GTIM_CR1_OFFSET);

  /* Disable the timer until we get it configured */

  cr1 &= ~(GTIM_CR1_CEN + GTIM_CR1_CKD_MASK);
  cr1 |= GTIM_CR1_URS;
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  /* Setup step pattern frequency */

  stepper_setup_frequency(priv, info->frequency);

  /* Disable channel outputs */

  ccer = stepper_getreg(priv, STM32_GTIM_CCER_OFFSET);
  ccer &= ~(GTIM_CCER_CC1E | GTIM_CCER_CC2E | GTIM_CCER_CC3E | GTIM_CCER_CC4E);

  stepper_putreg(priv, STM32_GTIM_CCER_OFFSET, ccer);

  /* Set the ARR Preload Bit */

  cr1 = stepper_getreg(priv, STM32_GTIM_CR1_OFFSET);
  cr1 |= GTIM_CR1_ARPE;
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  steppervdbg("enable irq:%u\n", priv->irq);
  stepper_putreg(priv, STM32_GTIM_SR_OFFSET, 0);
  stepper_putreg(priv, STM32_GTIM_DIER_OFFSET, GTIM_DIER_UIE);

  /* Start timer in one pulse mode. */

  cr1 |= GTIM_CR1_CEN + GTIM_CR1_OPM;
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  up_enable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: stepper_update
 *
 * Description:
 *   Reconfigure parameters for timer and step pattern
 *
 * Input parameters:
 *   priv      - lower half stepper state
 *   frequency - step pattern frequency
 *
 * Returned Value:
 *   Zero on success
 *
 ****************************************************************************/
static int stepper_update(FAR struct stm32_stepper_s *priv,
                          FAR const struct stepper_info_s *info)
{
  uint16_t cr1;
  uint32_t frequency;
  float    duration;

  steppervdbg("->\n");

  if ((info->pos_type == POS_ABSOLUTE) && (priv->target_pos ==
    info->position))
    {
      /* Target already set to requested position */

      return OK;
    }

  /* Disable interrupts and timer until we get it reconfigured */

  stepper_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);

  cr1 = stepper_getreg(priv, STM32_GTIM_CR1_OFFSET);
  cr1 &= ~GTIM_CR1_CEN;
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  if (info->pos_type == POS_ABSOLUTE)
    {
      duration = abs(info->position - priv->target_pos) /
        (float)info->frequency;
      priv->target_pos = info->position;
    }
  else
    {
      /* Relative position */

      duration = abs(info->position) / (float)info->frequency;
      priv->target_pos += info->position;
    }

  priv->direction = priv->target_pos > getreg32(priv->position_bkreg)?
    DIR_CW: DIR_CCW;

  /* Update frequency if duration is valid */

  if (duration > 0.0)
    {
      /* Calculate new frequency based on step pattern duration and
       * remaining steps.
       */

      frequency = (uint32_t)(abs(priv->target_pos - getreg32(
        priv->position_bkreg)) / duration);

      if (frequency == 0)
        {
          frequency = 1;
        }

      /* Update step pattern frequency */

      stepper_setup_frequency(priv, frequency);
    }
  else
    {
      frequency = info->frequency;
    }

  /* Enable timer and interrupts */

  cr1 |= GTIM_CR1_CEN + GTIM_CR1_OPM;
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);
  stepper_putreg(priv, STM32_GTIM_DIER_OFFSET, GTIM_DIER_UIE);

  steppervdbg("freq %u->%u\n", info->frequency, frequency);

  return OK;
}

/****************************************************************************
 * Name: stepper_interrupt
 *
 * Description:
 *   Handle timer interrupts.
 *
 * Input parameters:
 *   priv - lower half stepper state
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_interrupt(struct stm32_stepper_s *priv)
{
  if (getreg32(priv->position_bkreg) != priv->target_pos)
    {
      uint16_t cr1;
      uint32_t regval = stepper_getreg(priv, STM32_GTIM_SR_OFFSET);

      if (regval & GTIM_SR_UIF)
        {
          DEBUGASSERT((getreg32(STM32_PWR_CR) & PWR_CR_DBP));

          /* Update step and position indexes based on drive direction */

          if (priv->direction == DIR_CW)
            {
              putreg32(getreg32(priv->position_bkreg) + 1, priv->position_bkreg);
              STEP_INDEX_CW;
            }
          else
            {
              putreg32(getreg32(priv->position_bkreg) - 1, priv->position_bkreg);
              STEP_INDEX_CCW;
            }

