thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
          putreg32(priv->step[getreg32(priv->pattern_bkreg)],
            g_gpiobase[priv->gpio_port] + STM32_GPIO_BSRR_OFFSET);

          /* Clear the update interrupt bit */

          stepper_putreg(priv, STM32_GTIM_SR_OFFSET, regval & ~GTIM_SR_UIF);
        }

      /* Restart timer in one pulse mode */

      cr1 = stepper_getreg(priv, STM32_GTIM_CR1_OFFSET);
      cr1 |= (GTIM_CR1_CEN + GTIM_CR1_OPM);
      stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);
    }
  else
    {
      /* No steps left. Disable further interrupts, set output to standby and
         perform callback. */

      (void)stepper_stop((FAR struct stepper_lowerhalf_s *)priv);
      stepperllvdbg("No steps left\n");
      stepper_expired(priv->handle);
      priv->handle = NULL;
      stm32_pwr_enablebkp(false);
    }

  return OK;
}

/****************************************************************************
 * Name: stepper_timxinterrupt
 *
 * Description:
 *   Handle timer 2 - 5 interrupts.
 *
 * Input parameters:
 *   Standard NuttX interrupt inputs
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_TIM2_STEPPER
static int stepper_tim2interrupt(int irq, void *context)
{
  return stepper_interrupt(&g_stepper2dev);
}
#endif

#ifdef CONFIG_STM32_TIM3_STEPPER
static int stepper_tim3interrupt(int irq, void *context)
{
  return stepper_interrupt(&g_stepper3dev);
}
#endif

#ifdef CONFIG_STM32_TIM4_STEPPER
static int stepper_tim4interrupt(int irq, void *context)
{
  return stepper_interrupt(&g_stepper4dev);
}
#endif

#ifdef CONFIG_STM32_TIM5_STEPPER
static int stepper_tim5interrupt(int irq, void *context)
{
  return stepper_interrupt(&g_stepper5dev);
}
#endif

/****************************************************************************
 * Name: stepper_set_apb_clock
 *
 * Description:
 *   Enable or disable APB clock for the timer peripheral
 *
 * Input parameters:
 *   dev - lower half stepper state
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 ****************************************************************************/

static void stepper_set_apb_clock(FAR struct stm32_stepper_s *priv, bool on)
{
  uint32_t en_bit;
  uint32_t regaddr;

  /* Determine which timer to configure */

  switch (priv->timid)
    {
#ifdef CONFIG_STM32_TIM2_STEPPER
      case 2:
        regaddr  = STM32_RCC_APB1ENR;
        en_bit   = RCC_APB1ENR_TIM2EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM3_STEPPER
      case 3:
        regaddr  = STM32_RCC_APB1ENR;
        en_bit   = RCC_APB1ENR_TIM3EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM4_STEPPER
      case 4:
        regaddr  = STM32_RCC_APB1ENR;
        en_bit   = RCC_APB1ENR_TIM4EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM5_STEPPER
      case 5:
        regaddr  = STM32_RCC_APB1ENR;
        en_bit   = RCC_APB1ENR_TIM5EN;
        break;
#endif
      default:
        assert(false);
        break;
    }

  /* Enable/disable APB 1/2 clock for timer */

  if (on)
    {
      modifyreg32(regaddr, 0, en_bit);
    }
  else
    {
      modifyreg32(regaddr, en_bit, 0);
    }
}

/****************************************************************************
 * Name: stepper_setup
 *
 * Description:
 *   This method is called when the driver is opened. The lower half driver
 *   configures and initializes the device so that it is ready for use.
 *
 * Input parameters:
 *   dev - the lower half motor control driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_setup(FAR struct stepper_lowerhalf_s *dev)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;

  steppervdbg("TIM%d\n", priv->timid);
  stepper_dumpregs(priv, "Initially");

  /* Enable APB1/2 clocking for timer. */

  stepper_set_apb_clock(priv, true);

  steppervdbg("step[0] BSRR = 0x%08X\n", priv->step[0]);
  steppervdbg("step[1] BSRR = 0x%08X\n", priv->step[1]);
  steppervdbg("step[2] BSRR = 0x%08X\n", priv->step[2]);
  steppervdbg("step[3] BSRR = 0x%08X\n", priv->step[3]);
  steppervdbg("break   BSRR = 0x%08X\n", priv->step_break);
  steppervdbg("standby BSRR = 0x%08X\n", priv->step_standby);
  stm32_pwr_enablebkp(true);
  steppervdbg("position_bkreg: %d\n", getreg32(priv->position_bkreg));
  steppervdbg("pattern_bkreg: %d\n", getreg32(priv->pattern_bkreg));
  stm32_pwr_enablebkp(false);

  return OK;
}

/****************************************************************************
 * Name: stepper_shutdown
 *
 * Description:
 *   This method is called when the driver is closed. The lower half driver
 *   stops step pattern output, free any resources and disable the timer
 *   hardware.
 *
 * Input parameters:
 *   dev - the lower half motor control driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_shutdown(FAR struct stepper_lowerhalf_s *dev)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;
  int32_t current_pos;

  steppervdbg("TIM%d\n", priv->timid);

  current_pos = getreg32(priv->position_bkreg);

  /* Make sure that the output has been stopped */

  stepper_stop(dev);

  if (current_pos != priv->target_pos)
    {
      stepperdbg("shutdown while stepping %d->%d\n", current_pos,
        priv->target_pos);
    }

  /* Disable APB1/2 clocking for timer. */

  stepper_set_apb_clock(priv, false);

  return OK;
}

/****************************************************************************
 * Name: stepper_set_pos
 *
 * Description:
 *   Drive stepper to requested position index
 *
 * Input parameters:
 *   dev - the lower half stepper state
 *   info - step pattern characteristics
 *   handle - the upper-half expiration callback function
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_set_pos(FAR struct stepper_lowerhalf_s *dev,
                           FAR const struct stepper_info_s *info,
                           FAR void *handle)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;

