thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
  steppervdbg("TIM%d pos:%d (%s), freq:%d\n", priv->timid, info->position,
    info->pos_type == POS_ABSOLUTE? "abs" : "rel", info->frequency);

  if (info->frequency == 0)
    {
      stepperdbg("invalid frequency\n");
      return -EINVAL;
    }

  if (info->pos_type == POS_ABSOLUTE && (getreg32(priv->position_bkreg) ==
      info->position))
    {
      stepperdbg("current position index already set to %d\n", info->position);
      return -EINVAL;
    }

  if (info->pos_type == POS_RELATIVE && info->position == 0)
    {
      stepperdbg("Invalid relative step count: %d\n", info->position);
      return -EINVAL;
    }

  if (stepper_getreg(priv, STM32_GTIM_CR1_OFFSET) & GTIM_CR1_CEN)
    {
      /* Previous step pattern is still active, set new target position index
       * and update parameters.
       */

      return stepper_update(priv, info);
    }
  else
    {
      /* Previous state was standby, drive pre-excitation pulse as initial
       * state for step pattern (the last state of previous step sequence)
       */

      stm32_pwr_enablebkp(true);

      priv->handle = handle;

      /* Do step */

      putreg32(priv->step[getreg32(priv->pattern_bkreg)],
        g_gpiobase[priv->gpio_port] + STM32_GPIO_BSRR_OFFSET);

      /* Setup target position index and drive direction */

      if (info->pos_type == POS_ABSOLUTE)
        {
          int32_t pos = getreg32(priv->position_bkreg);
          stepperdbg("pos:%u\n", pos);
          priv->target_pos = info->position;
          priv->direction = info->position > pos?
            DIR_CW: DIR_CCW;
        }
      else
        {
          /* Relative position parameter */

          priv->target_pos += info->position;
          priv->direction = info->position > 0? DIR_CW: DIR_CCW;
        }

      return stepper_timer(priv, info);
    }
}

/****************************************************************************
 * Name: stepper_get_status
 *
 * Description:
 *   Get stepper status information
 *
 * Input parameters:
 *   dev    - the lower half stepper state
 *   status - stepper status
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_get_status(FAR struct stepper_lowerhalf_s *dev,
                              FAR struct stepper_status_s *status)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;

  DEBUGASSERT(status != NULL);
  if (!status)
    {
      return -EINVAL;
    }

  stm32_pwr_enablebkp(true);

  steppervdbg("TIM%d current_pos:%d, target_pos:%d, freq:%u, index:%u\n",
    priv->timid, getreg32(priv->position_bkreg), priv->target_pos,
    priv->frequency, getreg32(priv->pattern_bkreg));

  status->current_pos = getreg32(priv->position_bkreg);
  status->target_pos = priv->target_pos;
  status->frequency = priv->frequency;
  status->step_index = getreg32(priv->pattern_bkreg);

  stm32_pwr_enablebkp(false);

  return OK;
}

/****************************************************************************
 * Name: stepper_reset_index
 *
 * Description:
 *   Reset index to current position
 *
 * Input parameters:
 *   dev - the lower half stepper state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_reset_index(FAR struct stepper_lowerhalf_s *dev)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;
  irqstate_t flags;

  stepperllvdbg("TIM%d\n", priv->timid);

  flags = irqsave();
  stm32_pwr_enablebkp(true);

  putreg32(0, priv->position_bkreg);
  priv->target_pos = 0;

  stm32_pwr_enablebkp(false);
  irqrestore(flags);

  return OK;
}

/****************************************************************************
 * Name: stepper_set_pattern_index
 *
 * Description:
 *   Set step pattern index
 *
 * Input parameters:
 *   dev - the lower half stepper state structure
 *   index - stepper pattern index
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_set_pattern_index(FAR struct stepper_lowerhalf_s *dev,
                                     unsigned int index)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;
  irqstate_t flags;
  int ret = OK;

  steppervdbg("TIM%d\n", priv->timid);

  flags = irqsave();

  if (index > MAX_STEP_INDEX)
    {
      stepperdbg("value %u out of range\n", index);
      ret = -EINVAL;
      goto err_out;
    }

  stm32_pwr_enablebkp(true);
  putreg32(index, priv->pattern_bkreg);
  stm32_pwr_enablebkp(false);

err_out:
  irqrestore(flags);
  return ret;
}

/****************************************************************************
 * Name: stepper_stop
 *
 * Description:
 *   Stop step pattern output and reset the timer resources
 *
 * Input parameters:
 *   dev - the lower half stepper state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   This function is called to stop the step pattern output. This method is
 *   also called from the timer interrupt handler.
 *
 ****************************************************************************/

static int stepper_stop(FAR struct stepper_lowerhalf_s *dev)
{
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;
  uint32_t resetbit;
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  stepperllvdbg("TIM%d\n", priv->timid);

  /* Disable interrupts momentary to stop any ongoing timer processing and
   * to prevent any concurrent access to the reset register.
   */

  flags = irqsave();

  /* Disable further interrupts and stop the timer */

  stepper_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  stepper_putreg(priv, STM32_GTIM_SR_OFFSET, 0);
  stepper_putreg(priv, STM32_GTIM_CR1_OFFSET, 0);

  /* Determine which timer to reset */

