thingsee/thingsee-sdk/nuttx/arch/arm/src/stm32/stm32_stepper.c
  switch (priv->timid)
    {
#ifdef CONFIG_STM32_TIM2_STEPPER
      case 2:
        regaddr  = STM32_RCC_APB1RSTR;
        resetbit = RCC_APB1RSTR_TIM2RST;
        break;
#endif
#ifdef CONFIG_STM32_TIM3_STEPPER
      case 3:
        regaddr  = STM32_RCC_APB1RSTR;
        resetbit = RCC_APB1RSTR_TIM3RST;
        break;
#endif
#ifdef CONFIG_STM32_TIM4_STEPPER
      case 4:
        regaddr  = STM32_RCC_APB1RSTR;
        resetbit = RCC_APB1RSTR_TIM4RST;
        break;
#endif
#ifdef CONFIG_STM32_TIM5_STEPPER
      case 5:
        regaddr  = STM32_RCC_APB1RSTR;
        resetbit = RCC_APB1RSTR_TIM5RST;
        break;
#endif
      default:
        assert(false);
        break;
    }

  /* Reset the timer */

  regval  = getreg32(regaddr);
  regval |= resetbit;
  putreg32(regval, regaddr);

  regval &= ~resetbit;
  putreg32(regval, regaddr);
  irqrestore(flags);

  /* Disable output */

  putreg32(priv->step_break, g_gpiobase[priv->gpio_port] + STM32_GPIO_BSRR_OFFSET);

  stepperllvdbg("regaddr: %08x resetbit: %08x\n", regaddr, resetbit);

  return OK;
}

/****************************************************************************
 * Name: stepper_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input parameters:
 *   dev - the lower half stepper state structure
 *   cmd - ioctl command
 *   arg - ioctl command argument
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stepper_ioctl(FAR struct stepper_lowerhalf_s *dev, int cmd,
                         unsigned long arg)
{
#ifdef CONFIG_STEPPER_DEBUG
  FAR struct stm32_stepper_s *priv = (FAR struct stm32_stepper_s *)dev;

  /* There are no platform-specific ioctl commands */

  stepperdbg("TIM%d\n", priv->timid);
#endif
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_stepper_initialize
 *
 * Description:
 *   Initialize one timer for use with the upper_level motor control driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer. The number of valid timer IDs
 *   varies with the STM32 MCU.
 *
 * Returned Value:
 *   On success, a pointer to the STM32 lower half motor control driver is
 *   returned. NULL is returned on any failure.
 *
 ****************************************************************************/

FAR struct stepper_lowerhalf_s *stm32_stepper_initialize(int timer)
{
  FAR struct stm32_stepper_s *lower;

  steppervdbg("stm32_stepper_initialize -> TIM%d\n", timer);

  switch (timer)
    {
#ifdef CONFIG_STM32_TIM2_STEPPER
      case 2:
        lower = &g_stepper2dev;
        irq_attach(lower->irq, stepper_tim2interrupt);
        up_disable_irq(lower->irq);
        break;
#endif
#ifdef CONFIG_STM32_TIM3_STEPPER
      case 3:
        lower = &g_stepper3dev;
        irq_attach(lower->irq, stepper_tim3interrupt);
        up_disable_irq(lower->irq);
        break;
#endif
#ifdef CONFIG_STM32_TIM4_STEPPER
      case 4:
        lower = &g_stepper4dev;
        irq_attach(lower->irq, stepper_tim4interrupt);
        up_disable_irq(lower->irq);
        break;
#endif
#ifdef CONFIG_STM32_TIM5_STEPPER
      case 5:
        lower = &g_stepper5dev;
        irq_attach(lower->irq, stepper_tim5interrupt);
        up_disable_irq(lower->irq);
        break;
#endif
      default:
        stepperdbg("No such timer (%d) configured\n", timer);
        return NULL;
    }

  return (FAR struct stepper_lowerhalf_s *)lower;
}
